In [2]:
import numpy as np 
import pandas as pd

In [3]:
links = pd.read_csv("C:\code\gitpythonnangcao\\baitap pỵthon\\chuong3\\bai3.12\links.csv")
links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [4]:
links.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   imdbId   9742 non-null   int64
 2   tmdbId   9734 non-null   float64
dtypes: float64(1), int64(2)
memory usage: 228.5 KB

In [5]:
links.dtypes

movieId      int64
imdbId       int64
tmdbId     float64
dtype: object

In [6]:
links['tmdbId'].fillna(links['tmdbId'].max(),inplace= True)
links.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   imdbId   9742 non-null   int64
 2   tmdbId   9742 non-null   float64
dtypes: float64(1), int64(2)
memory usage: 228.5 KB

C:\Users\PLC\AppData\Local\Temp\ipykernel_21776\3112188624.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  links['tmdbId'].fillna(links['tmdbId'].max(),inplace= True)

## movie

In [7]:
movie = pd.read_csv("C:\code\gitpythonnangcao\\baitap pỵthon\chuong3\\bai3.12\movies.csv")
movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

## Rating

In [8]:
rating = pd.read_csv("C:\code\gitpythonnangcao\\baitap pỵthon\chuong3\\bai3.12\\ratings.csv")
rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

## tags

In [9]:
tags = pd.read_csv("C:\code\gitpythonnangcao\\baitap pỵthon\chuong3\\bai3.12\\tags.csv")
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [10]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [14]:
data = pd.concat((links,movie))
data

,movieId,imdbId,tmdbId,title,genres
0,1,114709.0,862.0,NaN,NaN
1,2,113497.0,8844.0,NaN,NaN
2,3,113228.0,15602.0,NaN,NaN
3,4,114885.0,31357.0,NaN,NaN
4,5,113041.0,11862.0,NaN,NaN
...,...,...,...,...,...
9737,193581,NaN,NaN,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,NaN,NaN,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,NaN,NaN,Flint (2017),Drama
9740,193587,NaN,NaN,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,NaN,NaN,Andrew Dice Clay: Dice Rules (1991),Comedy